"" + 1 + 0 // "" + 1 = "1"(перетворює число на рядок), "1" + 0 = "10"
"" - 1 + 0 // "" рядок при перетворенні на число стає 0, 0 - 1 = -1 + 0 = -1
true + false // 1 + 0 = 1
6 / "3" // 2
"2" * "3" // 6
4 + 5 + "px" // "9px"
"$" + 4 + 5 // "$" + 4 = "$4" + 5 = "$45"
"4" - 2 // 2
"4px" - 2 // "4px"(не зможе перетворитися на число, тому) NaN - 2 = NaN (результат будь-якої дії з NaN буде NaN)
"-9" + 5 // "-95"
"-9" - 5 // -14
null + 1 // null = 0, 0 + 1 = 1
undefined + 1 // undefined = NaN, NaN + 1 = NaN
"\t\n" - 2 // (\t табуляція, \n символ нового рядка)-при перетворенні начисло дають 0, 0 - 2 = -2